riraosan/ESP32_LEDMatrix_Clock/src/main.cpp
    log_i("HH:MM:SS = %02d:%02d:%02d", tm->tm_hour, tm->tm_min, tm->tm_sec);

    if (start_hour <= tm->tm_hour && tm->tm_hour < end_hour)
    {
        return true;
    }
    else
    {
        return false;
    }
}

void checkSensor()
{
    message = MESSAGE::MSG_COMMAND_SENSOR;
}

void stopClock()
{
    if (active == true)
    {
        clocker.detach();
        sensor_checker.detach();
        active = false;
    }
}

void startClock()
{
    if (active == false)
    {
        clocker.attach_ms(500, blink);
        sensor_checker.attach(60, checkSensor);
        active = true;
    }
}

void check_clock()
{
    bool IsClock = check_clock_enable(CLOCK_EN_S, CLOCK_EN_E);

    if (IsClock == true)
    {
        if (active == false)
        {
            startClock();
            active = true;
        }
    }
    else
    {
        if (active == true)
        {
            stopClock();
            clearLEDMatrix();
            active = false;
        }
    }
}

String getServerInfo(String hostName, String uri)
{
    String jsonBody;
    HTTPClient http;

    long oldTime = millis();
    log_i("START getServerInfo():%dms", millis() - oldTime);
    log_i("Starting connection to %s.local Web server...", hostName.c_str());

    IPAddress ip = MDNS.queryHost(hostName);
    log_i("[%d]Hostname : %s IPaddress : %s", millis() - oldTime, hostName.c_str(), ip.toString().c_str());

    http.begin(ip.toString(), 80, uri);
    int httpCode = http.GET();

    if (httpCode < 0)
    {
        log_e("Connection failed! code : %d", httpCode);
        jsonBody = "";
    }
    else
    {
        log_i("Connected to server! code : %d", httpCode);
        jsonBody = http.getString();
    }

    if (http.connected())
    {
        http.end();
    }

    log_i("END getServerInfo():%dms", millis() - oldTime);

    return jsonBody;
}

void initClock()
{
    //Get NTP Time
    configTzTime("JST-9", "ntp.nict.jp", "ntp.jst.mfeed.ad.jp");

    delay(2000);

    check_clock();

    checker.attach(60, check_clock);
}

void printTemperature()
{
    char buffer[10] = {0};
    float _temperature = doc["temperatur"]; // 21.93
    sprintf(buffer, "T:%4.1f*C", _temperature);
    log_i("temperature : [%s]", String(buffer));

    printStatic(String(buffer));
}

void printPressure()
{
    char buffer[10] = {0};
    float _pressure = doc["pressur"]; // 1015.944
    sprintf(buffer, "P:%6.1f", _pressure);
    log_i("pressure : [%s]", String(buffer).c_str());

    printStatic(String(buffer));
}

void printHumidity()
{
    char buffer[10] = {0};
    float _humidity = doc["humidity"]; // 39.27832
    sprintf(buffer, "H:%5.1f%%", _humidity);
    log_i("humidity : [%s]", String(buffer).c_str());

    printStatic(String(buffer));
}

void getBME280Info()
{
    String json = getServerInfo(DIST_HOSTNAME, APIURI);
    if (json.isEmpty())
    {
        if (retry < 2)
        {
            retry++;
            checkSensor();
            delay(3000);
            return;
        }
        else
        {
            retry = 0;
            message = MESSAGE::MSG_COMMAND_NOTHING;
            return;
        }
    }
    else
    {
        retry = 0;

        stopClock();

        log_d("Body = %s", json.c_str());
        deserializeJson(doc, json);

        ESPUI.updateControlValue(timeLabelId, makeCreateTime());
        ESPUI.updateControlValue(temperatureLabelId, String((float)doc["temperatur"]) + String(" °C"));
        ESPUI.updateControlValue(humidityLabelId, String((float)doc["humidity"]) + String(" %"));
        ESPUI.updateControlValue(pressurLabelId, String((float)doc["pressur"]) + String(" hPa"));

        message = MESSAGE::MSG_COMMAND_TEMPERATURE;
    }
}

#ifdef ESP32_BLE

static void notifyCallback(BLERemoteCharacteristic *pBLERemoteCharacteristic, uint8_t *pData, size_t length, bool isNotify)
{
    log_i("Notify callback for characteristic %s of data length %d", pBLERemoteCharacteristic->getUUID().toString().c_str(), length);
}

class MyClientCallback : public BLEClientCallbacks
{
    void onConnect(BLEClient *pclient)
    {
        log_i("onConnect");
        message = MESSAGE::MSG_COMMAND_BLE_CONNECTED;
    }

    void onDisconnect(BLEClient *pclient)
    {
        log_i("onDisconnect");
        message = MESSAGE::MSG_COMMAND_BLE_DISCONNECTED;
    }
};

bool connectToServer(BLEAddress pAddress)
{
    log_i("Forming a connection to %s", pAddress.toString().c_str());

    BLEClient *pClient = BLEDevice::createClient();
    log_i(" - Created client");

    pClient->setClientCallbacks(new MyClientCallback());

    // Connect to the remove BLE Server.
    pClient->connect(pAddress);
    log_i(" - Connected to server");

    // Obtain a reference to the service we are after in the remote BLE server.
    BLERemoteService *pRemoteService = pClient->getService(serviceUUID);
    if (pRemoteService == nullptr)
    {
        log_i("Failed to find our service UUID: %s", serviceUUID.toString().c_str());
        return false;
    }
    log_i(" - Found our service");

    // Obtain a reference to the characteristic in the service of the remote BLE server.
    pRemoteCharacteristic = pRemoteService->getCharacteristic(charUUID);
    if (pRemoteCharacteristic == nullptr)
    {
        log_i("Failed to find our characteristic UUID: %s", charUUID.toString().c_str());
        return false;
    }

    log_i(" - Found our characteristic");

    // Read the value of the characteristic.
    std::string value = pRemoteCharacteristic->readValue();
    log_i("The characteristic value was: %s", value.c_str());

    pRemoteCharacteristic->registerForNotify(notifyCallback);

    return true;
}

/**
 * Scan for BLE servers and find the first one that advertises the service we are looking for.
 */
class MyAdvertisedDeviceCallbacks : public BLEAdvertisedDeviceCallbacks
{
    /**
   * Called for each advertising BLE server.
   */
    void onResult(BLEAdvertisedDevice advertisedDevice)
    {
        log_i("BLE Advertised Device found: %s", advertisedDevice.toString().c_str());

        // We have found a device, let us now see if it contains the service we are looking for.
        if (advertisedDevice.haveServiceUUID() && advertisedDevice.getServiceUUID().equals(serviceUUID))
        {
            log_i("Found our device!  address: %s", advertisedDevice.getAddress().toString().c_str());
            advertisedDevice.getScan()->stop();

            pServerAddress = new BLEAddress(advertisedDevice.getAddress());
            message = MESSAGE::MSG_COMMAND_BLE_DO_CONNECT;

        } // Found our server
        else
        {
            message = MESSAGE::MSG_COMMAND_BLE_NOT_FOUND;
        } // Not found our server
    }     // onResult
};        // MyAdvertisedDeviceCallbacks

